#!/usr/bin/perl
print "Введите день\n";
$day= <STDIN>;
print "Введите месяц\n";
$month= <STDIN>;
print "Введите год\n";
$year= <STDIN>;

$name = "Свинарев, Шахманов";

$num = "1";

$==3; #длина страницы
$^=SALUT_FORMAT_TOP; #верхние колонтитул
$~=SALUT_FORMAT;

write;
format SALUT_FORMAT_TOP=
@|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
"Общая структура программы. Ввод и вывод информации."
@>>>>>>>>>>>>>>>>>>
"Форматы"
.
format SALUT_FORMAT=
Лабораторная работа №@#
$num
Текущая дата:
@##.@##.@####
$day, $month, $year
Работу выполнили:
@<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
$name
.

